<html>

<head>
<meta http-equiv="description" content="SuperMemo Collection: all in one, Page: 为什么用成员初始化列表会快一些？">
<meta http-equiv="keywords" content="SuperMemo, all in one, 为什么用成员初始化列表会快一些？">
<meta name="GENERATOR" content="SuperMemo for Windows (Build 18.05)">
<title>all in one: 为什么用成员初始化列表会快一些？ (SuperMemo collection)</title>
</head>

<body>

<p align="center"><b><font size="5">all in one: 为什么用成员初始化列表会快一些？ </font></b><br>(1 elements)</p>
<a name="TopOfPages"> </a>
<b>Contents:</b>
<div align="center">
<center>
<table border="1" cellpadding="5" cellspacing="5" width="100%" bgcolor="#FFCCFF">
<tr>
<td width="100%">
  <a href="index.htm">Root</a> <a href="3573.htm"> - Next</a> - <a href="3562.htm">Previous</a> - <a href="2121.htm">Parent</a> - <a href="3573.htm">Next sibling</a> - <a href="3562.htm">Previous sibling</a>
<font size="2">
<ul>
<li><a href="index.htm">C++</a></li>
<ul>
<li><a href="2121.htm">MIO笔记</a></li>
<ul>
<li>This page: 为什么用成员初始化列表会快一些？</li>
<ol>
<li>为什么用成员初始化列表会快一些？ 说明：数据类型可分为内置类型和用户自定义类型（类类型），对于用户自定义类型，利用成员初始化列表效率高。  原因：用户自定义类型如果使用类初始化列表，直接调用该成员变量对应的构造函数即完成初始化；如果在构造函数中初始化，因为C++规定，对象的[ . (see <a href="#3570">below)</a>
</ol>
</ul>
</ul>
</ul>
</font>
</td>
</tr>
</table>
</center>
</div>

<div align="center">
<center>
<table border="4" cellpadding="5" cellspacing="5" width="100%" bgcolor="#FFFF00" bordercolor="#FF0000">
<tr>
<td>
<b>Subject: Topic #3,569: &#20026;&#20160;&#20040;&#29992;&#25104;&#21592;&#21021;&#22987;&#21270;&#21015;&#34920;&#20250;&#24555;&#19968;&#20123;&#65311;</b><p>
</td>
</tr>
<tr>
<td bordercolor="#FFCC00">
&#20026;&#20160;&#20040;&#29992;&#25104;&#21592;&#21021;&#22987;&#21270;&#21015;&#34920;&#20250;&#24555;&#19968;&#20123;&#65311;</P>
<P>
<P>&#35828;&#26126;&#65306;&#25968;&#25454;&#31867;&#22411;&#21487;&#20998;&#20026;&#20869;&#32622;&#31867;&#22411;&#21644;&#29992;&#25143;&#33258;&#23450;&#20041;&#31867;&#22411;&#65288;&#31867;&#31867;&#22411;&#65289;&#65292;&#23545;&#20110;&#29992;&#25143;&#33258;&#23450;&#20041;&#31867;&#22411;&#65292;&#21033;&#29992;&#25104;&#21592;&#21021;&#22987;&#21270;&#21015;&#34920;&#25928;&#29575;&#39640;&#12290; 
<P>&#21407;&#22240;&#65306;&#29992;&#25143;&#33258;&#23450;&#20041;&#31867;&#22411;&#22914;&#26524;&#20351;&#29992;&#31867;&#21021;&#22987;&#21270;&#21015;&#34920;&#65292;&#30452;&#25509;&#35843;&#29992;&#35813;&#25104;&#21592;&#21464;&#37327;&#23545;&#24212;&#30340;&#26500;&#36896;&#20989;&#25968;&#21363;&#23436;&#25104;&#21021;&#22987;&#21270;&#65307;&#22914;&#26524;&#22312;&#26500;&#36896;&#20989;&#25968;&#20013;&#21021;&#22987;&#21270;&#65292;&#22240;&#20026;C++&#35268;&#23450;&#65292;&#23545;&#35937;&#30340;<SPAN class=clozed>&#25104;&#21592;&#21464;&#37327;&#30340;&#21021;&#22987;&#21270;&#21160;&#20316;</SPAN>&#21457;&#29983;&#22312;&#36827;&#20837;&#26500;&#36896;&#20989;&#25968;&#26412;&#20307;&#20043;&#21069;&#65292;&#37027;&#20040;&#22312;&#25191;&#34892;&#26500;&#36896;&#20989;&#25968;&#30340;&#20989;&#25968;&#20307;&#20043;&#21069;&#39318;&#20808;&#35843;&#29992;&#40664;&#35748;&#30340;&#26500;&#36896;&#20989;&#25968;&#20026;&#25104;&#21592;&#21464;&#37327;&#35774;&#21021;&#20540;&#65292;&#22312;&#36827;&#20837;&#20989;&#25968;&#20307;&#20043;&#21518;&#65292;&#35843;&#29992;&#35813;&#25104;&#21592;&#21464;&#37327;&#23545;&#24212;&#30340;&#26500;&#36896;&#20989;&#25968;&#12290;&#22240;&#27492;&#65292;&#20351;&#29992;&#21015;&#34920;&#21021;&#22987;&#21270;&#20250;&#20943;&#23569;&#35843;&#29992;&#40664;&#35748;&#30340;&#26500;&#36896;&#20989;&#25968;&#30340;&#36807;&#31243;&#65292;&#25928;&#29575;&#39640;&#12290;
</td>
</tr>
</table>
</center>
</div>
<hr>
<P align="center"><b><a name="3570">Item #3,570: &#20026;&#20160;&#20040;&#29992;&#25104;&#21592;&#21021;&#22987;&#21270;&#21015;&#34920;&#20250;&#24555;&#19968;&#20123;&#65311; &#35828;&#26126;&#65306;&#25968;&#25454;&#31867;&#22411;&#21487;&#20998;&#20026;&#20869;&#32622;&#31867;&#22411;&#21644;&#29992;&#25143;&#33258;&#23450;&#20041;&#31867;&#22411;&#65288;&#31867;&#31867;&#22411;&#65289;&#65292;&#23545;&#20110;&#29992;&#25143;&#33258;&#23450;&#20041;&#31867;&#22411;&#65292;&#21033;&#29992;&#25104;&#21592;&#21021;&#22987;&#21270;&#21015;&#34920;&#25928;&#29575;&#39640;&#12290;  &#21407;&#22240;&#65306;&#29992;&#25143;&#33258;&#23450;&#20041;&#31867;&#22411;&#22914;&#26524;&#20351;&#29992;&#31867;&#21021;&#22987;&#21270;&#21015;&#34920;&#65292;&#30452;&#25509;&#35843;&#29992;&#35813;&#25104;&#21592;&#21464;&#37327;&#23545;&#24212;&#30340;&#26500;&#36896;&#20989;&#25968;&#21363;&#23436;&#25104;&#21021;&#22987;&#21270;&#65307;&#22914;&#26524;&#22312;&#26500;&#36896;&#20989;&#25968;&#20013;&#21021;&#22987;&#21270;&#65292;&#22240;&#20026;C++&#35268;&#23450;&#65292;&#23545;&#35937;&#30340;[ .</a></P>
<div align="center">
<center>
<table border="1" cellpadding="5" cellspacing="5" width="100%" bgcolor="#99CCFF">
<tr>
<td bordercolor="#0066FF">
&#20026;&#20160;&#20040;&#29992;&#25104;&#21592;&#21021;&#22987;&#21270;&#21015;&#34920;&#20250;&#24555;&#19968;&#20123;&#65311;</P>
<P>
<P>&#35828;&#26126;&#65306;&#25968;&#25454;&#31867;&#22411;&#21487;&#20998;&#20026;&#20869;&#32622;&#31867;&#22411;&#21644;&#29992;&#25143;&#33258;&#23450;&#20041;&#31867;&#22411;&#65288;&#31867;&#31867;&#22411;&#65289;&#65292;&#23545;&#20110;&#29992;&#25143;&#33258;&#23450;&#20041;&#31867;&#22411;&#65292;&#21033;&#29992;&#25104;&#21592;&#21021;&#22987;&#21270;&#21015;&#34920;&#25928;&#29575;&#39640;&#12290; 
<P>&#21407;&#22240;&#65306;&#29992;&#25143;&#33258;&#23450;&#20041;&#31867;&#22411;&#22914;&#26524;&#20351;&#29992;&#31867;&#21021;&#22987;&#21270;&#21015;&#34920;&#65292;&#30452;&#25509;&#35843;&#29992;&#35813;&#25104;&#21592;&#21464;&#37327;&#23545;&#24212;&#30340;&#26500;&#36896;&#20989;&#25968;&#21363;&#23436;&#25104;&#21021;&#22987;&#21270;&#65307;&#22914;&#26524;&#22312;&#26500;&#36896;&#20989;&#25968;&#20013;&#21021;&#22987;&#21270;&#65292;&#22240;&#20026;C++&#35268;&#23450;&#65292;&#23545;&#35937;&#30340;<SPAN class=cloze>[...]</SPAN>&#21457;&#29983;&#22312;&#36827;&#20837;&#26500;&#36896;&#20989;&#25968;&#26412;&#20307;&#20043;&#21069;&#65292;&#37027;&#20040;&#22312;&#25191;&#34892;&#26500;&#36896;&#20989;&#25968;&#30340;&#20989;&#25968;&#20307;&#20043;&#21069;&#39318;&#20808;&#35843;&#29992;&#40664;&#35748;&#30340;&#26500;&#36896;&#20989;&#25968;&#20026;&#25104;&#21592;&#21464;&#37327;&#35774;&#21021;&#20540;&#65292;&#22312;&#36827;&#20837;&#20989;&#25968;&#20307;&#20043;&#21518;&#65292;&#35843;&#29992;&#35813;&#25104;&#21592;&#21464;&#37327;&#23545;&#24212;&#30340;&#26500;&#36896;&#20989;&#25968;&#12290;&#22240;&#27492;&#65292;&#20351;&#29992;&#21015;&#34920;&#21021;&#22987;&#21270;&#20250;&#20943;&#23569;&#35843;&#29992;&#40664;&#35748;&#30340;&#26500;&#36896;&#20989;&#25968;&#30340;&#36807;&#31243;&#65292;&#25928;&#29575;&#39640;&#12290;
</td>
</tr>
<tr>
<td bordercolor="#0066FF" bgcolor="#D0E8FF"> 
&#25104;&#21592;&#21464;&#37327;&#30340;&#21021;&#22987;&#21270;&#21160;&#20316;
</td>
</tr>
</table>
</center>
</div>
<hr>
<div align="center">
<center>
<table border="2" cellpadding="5" cellspacing="5" width="100%" bgcolor="#FFCC66">
<tr>
<td width="100%">
<p><b>About using this material:</b></p>
<p>The best way to <b>learn</b> this material is to use <a href="http://super-memory.com/english/smintro.htm">SuperMemo</a> software.<br>
SuperMemo is the world's leader in accelerated learning technologies
 (see: <a href="http://www.super-memory.com">SuperMemo Website</a>)
<p>
No download URL currently available
</td>
</tr>
<tr>
<td width="100%">
<b>Contact data:</b></p>
<p><b>Author: sm18-lazy-package</b><br>
<a href="http://super-memory.com">super-memory.com</a><br>
date: 4/27/2024 6:25:48 PM<br>
Page generated with:<br> SuperMemo 18<br>Build: 18.05 of Oct 29, 2020
</td>
</tr>
<tr>
<td width="100%">
</td>
</tr>
</table>
</center>
</div>
</body>

</html>
