<html>

<head>
<meta http-equiv="description" content="SuperMemo Collection: all in one, Page: 烧绳子问题介绍 燃烧一根不均匀的绳子需要一小时，怎么做才能问如何度量出半个小时，45分钟，75分钟？ 这道题目的一个难点就是不均匀，所以并不是从一端烧到绳子的中间就是半个小时。 三、解法思路 想解出烧绳子的问题，有两个关键度量时间点30分钟和15分钟： 1. 度量半个小时 .">
<meta http-equiv="keywords" content="SuperMemo, all in one, 烧绳子问题介绍 燃烧一根不均匀的绳子需要一小时，怎么做才能问如何度量出半个小时，45分钟，75分钟？ 这道题目的一个难点就是不均匀，所以并不是从一端烧到绳子的中间就是半个小时。 三、解法思路 想解出烧绳子的问题，有两个关键度量时间点30分钟和15分钟： 1. 度量半个小时 .">
<meta name="GENERATOR" content="SuperMemo for Windows (Build 18.05)">
<title>all in one: 烧绳子问题介绍 燃烧一根不均匀的绳子需要一小时，怎么做才能问如何度量出半个小时，45分钟，75分钟？ ... (SuperMemo collection)</title>
</head>

<body>

<p align="center"><b><font size="5">all in one: 烧绳子问题介绍 燃烧一根不均匀的绳子需要一小时，怎么做才能问如何度量出半个小时，45分钟，75分钟？ ... </font></b><br>(1 elements)</p>
<a name="TopOfPages"> </a>
<b>Contents:</b>
<div align="center">
<center>
<table border="1" cellpadding="5" cellspacing="5" width="100%" bgcolor="#FFCCFF">
<tr>
<td width="100%">
  <a href="index.htm">Root</a> <a href="3098.htm"> - Next</a> - <a href="1956.htm">Previous</a> - <a href="2967.htm">Parent</a> - <a href="3098.htm">Next sibling</a> - <a href="1956.htm">Previous sibling</a>
<font size="2">
<ul>
<li><a href="index.htm">C++</a></li>
<ul>
<li><a href="2967.htm">NNM笔记</a></li>
<ul>
<li>This page: 烧绳子问题介绍 燃烧一根不均匀的绳子需要一小时，怎么做才能问如何度量出半个小时，45分钟，75分钟？ 这道题目的一个难点就是不均匀，所以并不是从一端烧到绳子的中间就是半个小时。 三、解法思路 想解出烧绳子的问题，有两个关键度量时间点30分钟和15分钟： 1. 度量半个小时 .</li>
<ol>
<li>烧绳子问题介绍：  燃烧一根不均匀的绳子需要一小时，怎么做才能问如何度量出半个小时，45分钟，75分钟？ 这道题目的一个难点就是不均匀，所以并不是从一端烧到绳子的中间就是半个小时。 解法思路：  想解出烧绳子的问题，有两个关键度量时间点30分钟和15分钟： 1. 度量半个小时 . (see <a href="#3097">below)</a>
</ol>
</ul>
</ul>
</ul>
</font>
</td>
</tr>
</table>
</center>
</div>

<div align="center">
<center>
<table border="4" cellpadding="5" cellspacing="5" width="100%" bgcolor="#FFFF00" bordercolor="#FF0000">
<tr>
<td>
<b>Subject: Topic #3,096: &#28903;&#32499;&#23376;&#38382;&#39064;&#20171;&#32461; &#29123;&#28903;&#19968;&#26681;&#19981;&#22343;&#21248;&#30340;&#32499;&#23376;&#38656;&#35201;&#19968;&#23567;&#26102;&#65292;&#24590;&#20040;&#20570;&#25165;&#33021;&#38382;&#22914;&#20309;&#24230;&#37327;&#20986;&#21322;&#20010;&#23567;&#26102;&#65292;45&#20998;&#38047;&#65292;75&#20998;&#38047;&#65311; &#36825;&#36947;&#39064;&#30446;&#30340;&#19968;&#20010;&#38590;&#28857;&#23601;&#26159;&#19981;&#22343;&#21248;&#65292;&#25152;&#20197;&#24182;&#19981;&#26159;&#20174;&#19968;&#31471;&#28903;&#21040;&#32499;&#23376;&#30340;&#20013;&#38388;&#23601;&#26159;&#21322;&#20010;&#23567;&#26102;&#12290; &#19977;&#12289;&#35299;&#27861;&#24605;&#36335; &#24819;&#35299;&#20986;&#28903;&#32499;&#23376;&#30340;&#38382;&#39064;&#65292;&#26377;&#20004;&#20010;&#20851;&#38190;&#24230;&#37327;&#26102;&#38388;&#28857;30&#20998;&#38047;&#21644;15&#20998;&#38047;&#65306; 1. &#24230;&#37327;&#21322;&#20010;&#23567;&#26102; .</b><p>
</td>
</tr>
<tr>
<td bordercolor="#FFCC00">
&#28903;&#32499;&#23376;&#38382;&#39064;&#20171;&#32461;&#65306; 
<P>&#29123;&#28903;&#19968;&#26681;&#19981;&#22343;&#21248;&#30340;&#32499;&#23376;&#38656;&#35201;&#19968;&#23567;&#26102;&#65292;&#24590;&#20040;&#20570;&#25165;&#33021;&#38382;&#22914;&#20309;&#24230;&#37327;&#20986;&#21322;&#20010;&#23567;&#26102;&#65292;45&#20998;&#38047;&#65292;75&#20998;&#38047;&#65311;</P>
<P>&#36825;&#36947;&#39064;&#30446;&#30340;&#19968;&#20010;&#38590;&#28857;&#23601;&#26159;&#19981;&#22343;&#21248;&#65292;&#25152;&#20197;&#24182;&#19981;&#26159;&#20174;&#19968;&#31471;&#28903;&#21040;&#32499;&#23376;&#30340;&#20013;&#38388;&#23601;&#26159;&#21322;&#20010;&#23567;&#26102;&#12290;</P>
<P>&#35299;&#27861;&#24605;&#36335;&#65306; 
<P>&#24819;&#35299;&#20986;&#28903;&#32499;&#23376;&#30340;&#38382;&#39064;&#65292;&#26377;&#20004;&#20010;&#20851;&#38190;&#24230;&#37327;&#26102;&#38388;&#28857;30&#20998;&#38047;&#21644;15&#20998;&#38047;&#65306;</P>
<P>1. &#24230;&#37327;&#21322;&#20010;&#23567;&#26102; 
<P>&#31532;&#19968;&#20010;&#38382;&#39064;&#24230;&#37327;&#21322;&#20010;&#23567;&#26102;&#26102;&#26368;&#31616;&#21333;&#30340;&#65292;&#32499;&#23376;&#34429;&#28982;&#26159;&#19981;&#22343;&#21248;&#30340;&#65292;&#20294;&#26159;&#19968;&#26681;&#32499;&#23376;&#23436;&#25972;&#28903;&#23436;&#25152;&#29992;&#30340;&#26102;&#38388;&#26159;&#22266;&#23450;&#30340;&#12290;&#20174;&#20004;&#31471;&#28903;&#32499;&#23376;&#65292;&#31561;&#32499;&#23376;&#20840;&#37096;&#28903;&#23436;&#25152;&#29992;&#30340;&#26102;&#38388;&#23601;&#26159;&#21322;&#20010;&#23567;&#26102;&#12290;</P>
<P>2. &#24230;&#37327;15&#20998;&#38047; 
<P>&#24050;&#32463;&#21487;&#20197;&#24230;&#37327;&#20986;&#21322;&#20010;&#23567;&#26102;&#19982;&#19968;&#20010;&#23567;&#26102;&#20102;&#65292;&#25152;&#20197;&#24819;&#35201;&#24230;&#37327;&#20986;45&#20998;&#38047;&#19982;75&#20998;&#38047;&#21482;&#38656;&#35201;&#24230;&#37327;&#20986;15&#20998;&#38047;&#23601;&#21487;&#20197;&#20102;&#12290;</P>
<P>15&#20998;&#38047;&#24590;&#20040;&#24230;&#37327;&#30340;&#26041;&#27861;&#23601;&#26159;&#23558;<SPAN class=clozed>&#21322;&#20010;&#23567;&#26102;</SPAN>&#30340;&#32499;&#23376;&#20174;&#20004;&#31471;&#28903;&#65292;&#32499;&#23376;&#28903;&#23613;&#26102;&#25152;&#29992;&#30340;&#26102;&#38388;&#23601;&#26159;15&#20998;&#38047;&#12290;&#32780;&#25105;&#20204;&#21482;&#26377;&#19981;&#22343;&#21248;&#19968;&#20010;&#23567;&#26102;&#30340;&#32499;&#23376;&#65292;&#20174;&#32499;&#23376;&#20004;&#31471;&#28903;&#23613;&#21487;&#20197;&#33719;&#24471;&#21322;&#20010;&#23567;&#26102;&#65292;&#20294;&#26159;&#36825;&#26681;&#32499;&#23376;&#19981;&#33021;&#29992;&#26469;&#36827;&#34892;15&#20998;&#38047;&#30340;&#24230;&#37327;&#20102;&#65292;&#25152;&#20197;&#19968;&#20010;&#32499;&#23376;&#26159;&#24230;&#37327;&#19981;&#20986;15&#20998;&#38047;&#30340;&#65292;&#35299;&#20915;&#38382;&#39064;&#38656;&#35201;&#20004;&#26681;&#32499;&#23376;&#12290;</P>
<P>&#21435;&#20004;&#26681;&#32499;&#23376;&#20998;&#21035;&#32534;&#21495;1&#21644;2&#65292;&#32499;&#23376;1&#20174;&#20004;&#31471;&#24320;&#22987;&#28903;&#65292;&#32499;&#23376;2&#20174;&#19968;&#27573;&#24320;&#22987;&#28903;&#12290;&#24403;&#32499;&#23376;&#28903;&#23613;&#26102;&#65292;&#29060;&#28781;&#32499;&#23376;2&#12290;&#27492;&#26102;&#32499;&#23376;2&#29123;&#28903;&#23613;&#25152;&#38656;&#35201;&#30340;&#26102;&#38388;&#23601;&#26159;&#21322;&#20010;&#23567;&#26102;&#65292;&#20174;&#32499;&#23376;2&#20004;&#31471;&#28903;&#30340;&#35805;&#29123;&#23613;&#23601;&#26159;15&#20998;&#38047;&#12290;&#20851;&#38190;&#28857;15&#20998;&#38047;&#24050;&#32463;&#21487;&#20197;&#24230;&#37327;&#20986;&#26469;&#30340;&#20102;&#65292;&#37027;&#20040;&#21097;&#19979;&#30340;&#38382;&#39064;&#23601;&#36814;&#20995;&#32780;&#35299;&#20102;&#12290;
</td>
</tr>
</table>
</center>
</div>
<hr>
<P align="center"><b><a name="3097">Item #3,097: &#28903;&#32499;&#23376;&#38382;&#39064;&#20171;&#32461;&#65306;  &#29123;&#28903;&#19968;&#26681;&#19981;&#22343;&#21248;&#30340;&#32499;&#23376;&#38656;&#35201;&#19968;&#23567;&#26102;&#65292;&#24590;&#20040;&#20570;&#25165;&#33021;&#38382;&#22914;&#20309;&#24230;&#37327;&#20986;&#21322;&#20010;&#23567;&#26102;&#65292;45&#20998;&#38047;&#65292;75&#20998;&#38047;&#65311; &#36825;&#36947;&#39064;&#30446;&#30340;&#19968;&#20010;&#38590;&#28857;&#23601;&#26159;&#19981;&#22343;&#21248;&#65292;&#25152;&#20197;&#24182;&#19981;&#26159;&#20174;&#19968;&#31471;&#28903;&#21040;&#32499;&#23376;&#30340;&#20013;&#38388;&#23601;&#26159;&#21322;&#20010;&#23567;&#26102;&#12290; &#35299;&#27861;&#24605;&#36335;&#65306;  &#24819;&#35299;&#20986;&#28903;&#32499;&#23376;&#30340;&#38382;&#39064;&#65292;&#26377;&#20004;&#20010;&#20851;&#38190;&#24230;&#37327;&#26102;&#38388;&#28857;30&#20998;&#38047;&#21644;15&#20998;&#38047;&#65306; 1. &#24230;&#37327;&#21322;&#20010;&#23567;&#26102; .</a></P>
<div align="center">
<center>
<table border="1" cellpadding="5" cellspacing="5" width="100%" bgcolor="#99CCFF">
<tr>
<td bordercolor="#0066FF">
&#28903;&#32499;&#23376;&#38382;&#39064;&#20171;&#32461;&#65306; 
<P>&#29123;&#28903;&#19968;&#26681;&#19981;&#22343;&#21248;&#30340;&#32499;&#23376;&#38656;&#35201;&#19968;&#23567;&#26102;&#65292;&#24590;&#20040;&#20570;&#25165;&#33021;&#38382;&#22914;&#20309;&#24230;&#37327;&#20986;&#21322;&#20010;&#23567;&#26102;&#65292;45&#20998;&#38047;&#65292;75&#20998;&#38047;&#65311;</P>
<P>&#36825;&#36947;&#39064;&#30446;&#30340;&#19968;&#20010;&#38590;&#28857;&#23601;&#26159;&#19981;&#22343;&#21248;&#65292;&#25152;&#20197;&#24182;&#19981;&#26159;&#20174;&#19968;&#31471;&#28903;&#21040;&#32499;&#23376;&#30340;&#20013;&#38388;&#23601;&#26159;&#21322;&#20010;&#23567;&#26102;&#12290;</P>
<P>&#35299;&#27861;&#24605;&#36335;&#65306; 
<P>&#24819;&#35299;&#20986;&#28903;&#32499;&#23376;&#30340;&#38382;&#39064;&#65292;&#26377;&#20004;&#20010;&#20851;&#38190;&#24230;&#37327;&#26102;&#38388;&#28857;30&#20998;&#38047;&#21644;15&#20998;&#38047;&#65306;</P>
<P>1. &#24230;&#37327;&#21322;&#20010;&#23567;&#26102; 
<P>&#31532;&#19968;&#20010;&#38382;&#39064;&#24230;&#37327;&#21322;&#20010;&#23567;&#26102;&#26102;&#26368;&#31616;&#21333;&#30340;&#65292;&#32499;&#23376;&#34429;&#28982;&#26159;&#19981;&#22343;&#21248;&#30340;&#65292;&#20294;&#26159;&#19968;&#26681;&#32499;&#23376;&#23436;&#25972;&#28903;&#23436;&#25152;&#29992;&#30340;&#26102;&#38388;&#26159;&#22266;&#23450;&#30340;&#12290;&#20174;&#20004;&#31471;&#28903;&#32499;&#23376;&#65292;&#31561;&#32499;&#23376;&#20840;&#37096;&#28903;&#23436;&#25152;&#29992;&#30340;&#26102;&#38388;&#23601;&#26159;&#21322;&#20010;&#23567;&#26102;&#12290;</P>
<P>2. &#24230;&#37327;15&#20998;&#38047; 
<P>&#24050;&#32463;&#21487;&#20197;&#24230;&#37327;&#20986;&#21322;&#20010;&#23567;&#26102;&#19982;&#19968;&#20010;&#23567;&#26102;&#20102;&#65292;&#25152;&#20197;&#24819;&#35201;&#24230;&#37327;&#20986;45&#20998;&#38047;&#19982;75&#20998;&#38047;&#21482;&#38656;&#35201;&#24230;&#37327;&#20986;15&#20998;&#38047;&#23601;&#21487;&#20197;&#20102;&#12290;</P>
<P>15&#20998;&#38047;&#24590;&#20040;&#24230;&#37327;&#30340;&#26041;&#27861;&#23601;&#26159;&#23558;<SPAN class=cloze>[...]</SPAN>&#30340;&#32499;&#23376;&#20174;&#20004;&#31471;&#28903;&#65292;&#32499;&#23376;&#28903;&#23613;&#26102;&#25152;&#29992;&#30340;&#26102;&#38388;&#23601;&#26159;15&#20998;&#38047;&#12290;&#32780;&#25105;&#20204;&#21482;&#26377;&#19981;&#22343;&#21248;&#19968;&#20010;&#23567;&#26102;&#30340;&#32499;&#23376;&#65292;&#20174;&#32499;&#23376;&#20004;&#31471;&#28903;&#23613;&#21487;&#20197;&#33719;&#24471;&#21322;&#20010;&#23567;&#26102;&#65292;&#20294;&#26159;&#36825;&#26681;&#32499;&#23376;&#19981;&#33021;&#29992;&#26469;&#36827;&#34892;15&#20998;&#38047;&#30340;&#24230;&#37327;&#20102;&#65292;&#25152;&#20197;&#19968;&#20010;&#32499;&#23376;&#26159;&#24230;&#37327;&#19981;&#20986;15&#20998;&#38047;&#30340;&#65292;&#35299;&#20915;&#38382;&#39064;&#38656;&#35201;&#20004;&#26681;&#32499;&#23376;&#12290;</P>
<P>&#21435;&#20004;&#26681;&#32499;&#23376;&#20998;&#21035;&#32534;&#21495;1&#21644;2&#65292;&#32499;&#23376;1&#20174;&#20004;&#31471;&#24320;&#22987;&#28903;&#65292;&#32499;&#23376;2&#20174;&#19968;&#27573;&#24320;&#22987;&#28903;&#12290;&#24403;&#32499;&#23376;&#28903;&#23613;&#26102;&#65292;&#29060;&#28781;&#32499;&#23376;2&#12290;&#27492;&#26102;&#32499;&#23376;2&#29123;&#28903;&#23613;&#25152;&#38656;&#35201;&#30340;&#26102;&#38388;&#23601;&#26159;&#21322;&#20010;&#23567;&#26102;&#65292;&#20174;&#32499;&#23376;2&#20004;&#31471;&#28903;&#30340;&#35805;&#29123;&#23613;&#23601;&#26159;15&#20998;&#38047;&#12290;&#20851;&#38190;&#28857;15&#20998;&#38047;&#24050;&#32463;&#21487;&#20197;&#24230;&#37327;&#20986;&#26469;&#30340;&#20102;&#65292;&#37027;&#20040;&#21097;&#19979;&#30340;&#38382;&#39064;&#23601;&#36814;&#20995;&#32780;&#35299;&#20102;&#12290;
</td>
</tr>
<tr>
<td bordercolor="#0066FF" bgcolor="#D0E8FF"> 
&#21322;&#20010;&#23567;&#26102;
</td>
</tr>
</table>
</center>
</div>
<hr>
<div align="center">
<center>
<table border="2" cellpadding="5" cellspacing="5" width="100%" bgcolor="#FFCC66">
<tr>
<td width="100%">
<p><b>About using this material:</b></p>
<p>The best way to <b>learn</b> this material is to use <a href="http://super-memory.com/english/smintro.htm">SuperMemo</a> software.<br>
SuperMemo is the world's leader in accelerated learning technologies
 (see: <a href="http://www.super-memory.com">SuperMemo Website</a>)
<p>
No download URL currently available
</td>
</tr>
<tr>
<td width="100%">
<b>Contact data:</b></p>
<p><b>Author: sm18-lazy-package</b><br>
<a href="http://super-memory.com">super-memory.com</a><br>
date: 2024/4/28 16:47:56<br>
Page generated with:<br> SuperMemo 18<br>Build: 18.05 of Oct 29, 2020
</td>
</tr>
<tr>
<td width="100%">
</td>
</tr>
</table>
</center>
</div>
</body>

</html>
